#深浅拷贝
#赋值
# li=[1,2,3]
# li2=li#这就是赋值
# print(li2)
# li.append(4)
# print("li的值：",li)#li的值： [1, 2, 3, 4]
# print("li2的值：",li2)#li2的值： [1, 2, 3, 4]
#li的改变带动li2的改变，因为上文提到li2=li
#赋值：等于完全共享资源，一个值的改变会完全被另一个值共享，他们是同一个内存地址对象
# li2.append(5)
# print(li)#输出[1, 2, 3, 4, 5]
# print(li2)#输出[1, 2, 3, 4, 5]



#1.2浅拷贝(数据半共享)
#会创建新的对象，拷贝第一层的数据，嵌套层会指向原来的内存地址
# import copy #导入copy模块
# li=[1,2,3,[4,5,6]]
# li2=copy.copy(li)
# print("li的地址：",id(li))#输出li的地址： 2311167523840
# print("li2的地址",id(li2))#输出li2的地址 2311168952576
# #二者地址不同，说明二者不是同一个数据
# li.append(7)
# print(li)#输出[1, 2, 3, [4, 5, 6], 7]
# print(li2)#[1, 2, 3, [4, 5, 6]]
#也说明二者不共享地址
# li[3].append(90)
# print(li)#输出[1, 2, 3, [4, 5, 6, 90], 7]
# print(li2)#输出[1, 2, 3, [4, 5, 6, 90]]
# print(id(li[3]))#输出1810371638400
# print(id(li2[3]))#输出1810371638400
#总结，外层的地址不同，但内存的地址相同，
#优点，拷贝速度快，占用空间少，拷贝效率高


#1.3深拷贝（数据完全不共享）
#外层的对象和内部分元素都拷贝一遍
import copy #导入copy模块
li = [1, 2, 3, [4, 5, 6]]
li2=copy.deepcopy(li)
# print(id(li))#2352327998464
# print(id(li2))#2352328706304
# print(id(li[3]))#2352327881856
# print(id(li2[3]))#2352328243648
#内外层地址都不同
# li.append(7)
# print(li)#[1, 2, 3, [4, 5, 6], 7]
# print(li2)#[1, 2, 3, [4, 5, 6]]
# li[3].append(90)
# print(li)#[1, 2, 3, [4, 5, 6]]
# print(li2)#[1, 2, 3, [4, 5, 6]]
#深拷贝数据变化之影响自己本身，跟原来的对象无任何关系

#2.可变类型:变量对应的值可以修改，但是内存地址不会发生改变
#常见的可变类型：list（列表），dict（字典），set（集合）
# li=[1,2]
# print(id(li))#输出1929944526400
# li.append(3)
# print(id(li))#输出1929944526400
#虽然改变了数据值，但是内存地址没有发生改变
# dic={"name":"bingbing","age":18}
# print(dic,id(dic))#输出{'name': 'bingbing', 'age': 18} 2128921590016
# dic["name"]="susu"
# print(dic,id(dic))#输出{'name': 'bingbing', 'age': 18} 2128921590016

# se={1,2,3,4}
# print(se,id(se))#{1, 2, 3, 4} 2276867133216
# se.remove(3)
# print(se,id(se))#{1, 2, 4} 2276867133216



#不可变对象：存储空间保存的数据不允许被修改，这种数据就是不可变类型
#常见的不可变类型：int float bool complex str tuple类型
#含义：变量对应的值不能被修改，如果修改就会生成一个新的值从而分配新的内存空间
n=10
print(n,id(n))#10 140719034303896
n=15
print(n,id(n))#15 140719034304056
#两次输出内存地址不一样了，因为修改了n的值就会生成新的值，重新赋值给变量n
#其余不可变类型一样

